package arrayex;
/*
 * int[][] score ={
 * {30,80,70},{95,85,75},{70,80,75},{75,70,85},{70,75,80}};
 * [결과]
 * 				국어	영어	수학	총점	평균
 * 1번학생 : 		90	80	70	240	80.0
 * 2번학생 : 		95	85	75	255	99.9
 * 3번학생 : 		70	80	75	225	99.9
 * 4번학생 : 		75	70	85	230	99.9
 * 5번학생 : 		70	75	80	255	99.9
 * 과목합계 :		400	390	985	1175 99.9
 * 국어평균 :		99.9
 * 영어평균 :		99.9
 * 수학평균 : 		99.9
 */
public class Exam3 {
	public static void main(String[] args) {
		int[][] socre = {
				{30,80,70},{95,85,75},
				{70,80,75},{75,70,85},
				{70,75,80}
		};
		
	} 

}


